public class App {
    public static void main(String[] args) {
        // Создаем экземпляры телевизоров
        TV телевизор1 = new TV("Рубин", 32);
        TV телевизор2 = new TV("Горизонт", 27);
        телевизор1.включить();
        телевизор2.выключить();

        System.out.println("Производитель первого телевизора: " + телевизор1.getПроизводитель() +", размер экрана "+ телевизор1.getРазмер());
        System.out.println("Производитель второго телевизора: " + телевизор2.getПроизводитель() +", размер экрана "+ телевизор2.getРазмер());
    }
}
